Revit 2024 API
IFCAggregate.AddAggregate Method
 Creates a nested aggregate and adds it to the aggregate.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IFCAggregate AddAggregate()
Visual Basic
Public Function AddAggregate As IFCAggregate
Visual C++
public:
IFCAggregate^ AddAggregate()
Return Value
 The nested aggregate.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The aggregate is not valid.
See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace